
var handler = async (m, {conn}) => {
const media = './Menu2.jpg';
const grupos = `*𝙷𝙾𝙻𝙰 𝚄𝚂𝚄𝙰𝚁𝙸𝙾 👋🏻, 𝚃𝙴 𝙸𝙽𝚅𝙸𝚃𝙾 𝙰 𝚄𝙽𝙸𝚁𝚃𝙴 𝙰 𝙻𝙾𝚂 𝙶𝚁𝚄𝙿𝙾𝚂 𝙾𝙵𝙸𝙲𝙸𝙰𝙻𝙴𝚂 𝙳𝙴 𝐒𝐡𝐚𝐝𝐨𝐰𝐁𝐨𝐭 𝙿𝙰𝚁𝙰 𝙲𝙾𝙽𝚅𝙸𝚅𝙸𝚁 𝙲𝙾𝙽 𝙻𝙰 𝙲𝙾𝙼𝚄𝙽𝙸𝙳𝙰𝙳 :D*

╭━━❍𝐓𝐡𝐞 𝐒𝐡𝐚𝐝𝐨𝐰 𝐁𝐫𝐨𝐜𝐤𝐞𝐫𝐬 - 𝐁𝐨𝐭❍━━╮
┃ ╭━━━━━━━━━━━━━━━━╮
┃ ┃ ╭┈────────────╮
┃ ┃ │❍ 𝐆𝐑𝐔𝐏𝐎𝐒-𝐎𝐅𝐈𝐂𝐈𝐀𝐋𝐄𝐒 ❍
┃ ┃ ╰┈────────────╯
┃ ╰━━━━━━━━━━━━━━━━╯
╰━━━𝐆𝐑𝐔𝐏𝐎𝐒-𝐎𝐅𝐈𝐂𝐈𝐀𝐋𝐄𝐒╾━━━╯

╭┈───────────────╮
│ ▻ 𝙶𝚁𝚄𝙿𝙾 𝙳𝙴 𝙰𝙲𝚃𝚄𝙰𝙻𝙸𝚉𝙰𝙲𝙸𝙾𝙽𝙴𝚂 ◅
╰┈───────────────╯
╭━━━━━━━━━━━━━━━━━━━
┃⇛ https://chat.whatsapp.com/Gt8tzfxKFl15bqIAjxmqIe ⇚
╰━━━━━━━━━━━━━━━━━━━╯

╭━━━━━━━━━━━━━━━━━━━╾•
┃1: ${md} ⇚
┃2: https://chat.whatsapp.com/BmsElfLOkC6DYTo4rqaQcf
╰━━━━━━━━━━━━━━━━━━━━━╯

╭━━━━━━━━━━━━━━━━━━━╾•
┃ ➢ 𝐺𝑅𝑈𝑃𝑂 𝐷𝐸 𝑀𝐼𝑁𝐸𝐶𝑅𝐴𝐹𝑇 
╰━━━━━━━━━━━━━━━━━━━━╯

╭━━━━━━━━━━━━━━━━━━━╾
┃ https://chat.whatsapp.com/HNayAS8WrE1EtThLpkllRS
╰━━━━━━━━━━━━━━━━━━━━╯`; 

  conn.sendFile(m.chat, media,'dorrat.jpg',grupos)};
handler.command = /^linkgc|grupos$/i;
export default handler;
